# Самостоятельное задание 1.

In [1]:
import pandas as pd

#### Описание данных

В папке Data находится информация о студентах. Всего 10 групп студентов. Файлы делятся на две категории:
    * Students_info_i - информация о студентах из группы i
    * Students_marks_i - оценки студентов из группы i за экзамены

### Одно из важных достоинств pandas $-$ это удобные методы реляционного взаимодействия с данными, аналогичные, например, возможностям SQL для слияния и конкатенации таблиц: merge, join, concat. Наличие готовых методов позволяет не реализовывать самостоятельно поэлементную обработку данных и оперировать сразу целыми таблицами данных.

Подробно об этих методах посмотрите тут: https://www.kaggle.com/residentmario/renaming-and-combining#Combining

#### Задание 1. Соберите всю информацию о студентах в одну таблицу df. В получившейся таблице должна быть информация и оценки всех студентов из всех групп. Напечатайте несколько строк таблицы для демонстрации результата.¶

In [10]:
#your code here
import os

info_df = pd.DataFrame()
marks_df = pd.DataFrame()

for file_name in os.listdir('Data'):
    if 'info' in file_name:
        if len(info_df) == 0:
            info_df = pd.read_csv(f'Data/{file_name}', encoding='utf-8', sep=',')
        else:
            info_df = pd.concat([info_df, pd.read_csv(f'Data/{file_name}', encoding='utf-8', sep=',')])
    else:
        if len(marks_df) == 0:
            marks_df = pd.read_csv(f'Data/{file_name}', encoding='utf-8', sep=',')
        else:
            marks_df = pd.concat([marks_df, pd.read_csv(f'Data/{file_name}', encoding='utf-8', sep=',')])

1000

In [27]:
info_df.head()

,index,gender,race/ethnicity,parental level of education,lunch,test preparation course,group
0,100,male,group B,some college,standard,none,group2
1,101,male,group D,bachelor's degree,standard,completed,group2
2,102,female,group D,associate's degree,standard,none,group2
3,103,male,group B,high school,standard,completed,group2
4,104,male,group C,some college,standard,completed,group2

In [28]:
marks_df.head()

   index  math score  reading score  writing score
0    100          79             67             67
1    101          68             74             74
2    102          85             91             89
3    103          60             44             47
4    104          98             86             90

In [32]:
df = pd.merge(info_df, marks_df, how='inner', on='index')
df.head()

,index,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,100,male,group B,some college,standard,none,group2,79,67,67
1,101,male,group D,bachelor's degree,standard,completed,group2,68,74,74
2,102,female,group D,associate's degree,standard,none,group2,85,91,89
3,103,male,group B,high school,standard,completed,group2,60,44,47
4,104,male,group C,some college,standard,completed,group2,98,86,90

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   index                        1000 non-null   int64
 1   gender                       1000 non-null   object
 2   race/ethnicity               1000 non-null   object
 3   parental level of education  1000 non-null   object
 4   lunch                        1000 non-null   object
 5   test preparation course      1000 non-null   object
 6   group                        1000 non-null   object
 7   math score                   1000 non-null   int64
 8   reading score                1000 non-null   int64
 9   writing score                1000 non-null   int64
dtypes: int64(4), object(6)
memory usage: 85.9+ KB

#### Задание 2. Удалите столбец index у полученной таблицы. Напечатайте первые 10 строк таблицы.

In [33]:
#your code here
df.drop(columns='index', inplace=True)
df.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,male,group B,some college,standard,none,group2,79,67,67
1,male,group D,bachelor's degree,standard,completed,group2,68,74,74
2,female,group D,associate's degree,standard,none,group2,85,91,89
3,male,group B,high school,standard,completed,group2,60,44,47
4,male,group C,some college,standard,completed,group2,98,86,90
5,female,group C,some college,standard,none,group2,58,67,72
6,female,group D,master's degree,standard,none,group2,87,100,100
7,male,group E,associate's degree,standard,completed,group2,66,63,64
8,female,group B,associate's degree,free/reduced,none,group2,52,76,70
9,female,group B,some high school,standard,none,group2,70,64,72

#### Задание 3. Выведите на экран размеры полученной таблицы

In [40]:
# your code here
df.shape

(1000, 9)

#### Задание 4. Выведите на экран статистические характеристики числовых столбцов таблицы (минимум, максимум, среднее значение, стандартное отклонение)

In [41]:
# your code here
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

#### Задание 5. Проверьте, есть ли в таблице пропущенные значения

In [42]:
# your code here
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   group                        1000 non-null   object
 6   math score                   1000 non-null   int64
 7   reading score                1000 non-null   int64
 8   writing score                1000 non-null   int64
dtypes: int64(3), object(6)
memory usage: 78.1+ KB

#### Задание 6. Выведите на экран средние баллы студентов по каждому предмету (math, reading, writing)

In [46]:
# your code here
df.describe().loc['mean']

math score       66.089
reading score    69.169
writing score    68.054
Name: mean, dtype: float64

**Задание 7. Как зависят оценки от того, проходил ли студент курс для подготовки к сдаче экзамена (test preparation course)? Выведите на экран для каждого предмета в отдельности средний балл студентов, проходивших курс для подготовки к экзамену и не проходивших курс.**

In [48]:
# your code here
df.groupby(by='test preparation course').mean()

                         math score  reading score  writing score
test preparation course
completed                 69.695531      73.893855      74.418994
none                      64.077882      66.534268      64.504673

**Задание 8. Выведите на экран все различные значения из столбца lunch.**

In [49]:
# your code here
df['lunch'].unique()

array(['standard', 'free/reduced'], dtype=object)

**Задание 9. Переименуйте колонку "parental level of education" в "education", а "test preparation course" в "test preparation" с помощью метода pandas rename**
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html

In [50]:
# your code here
df.rename(columns={'parental level of education': 'education', 'test preparation course': 'test preparation'}, inplace=True)
df.head()

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score
0,male,group B,some college,standard,none,group2,79,67,67
1,male,group D,bachelor's degree,standard,completed,group2,68,74,74
2,female,group D,associate's degree,standard,none,group2,85,91,89
3,male,group B,high school,standard,completed,group2,60,44,47
4,male,group C,some college,standard,completed,group2,98,86,90

**Зафиксируем минимальный балл для сдачи экзамена**

In [51]:
passmark = 50

**Задание 10. Ответьте на вопросы:**
    * Какая доля студентов сдала экзамен по математике (passmark > 50)?
    * Какая доля студентов, проходивших курс подготовки к экзамену, сдала экзамен по математике?
    * Какая доля женщин, не проходивших курс подготовки к экзамену, не сдала экзамен по математике?

In [130]:
# your code here
# Какая доля студентов сдала экзамен по математике (passmark > 50)?
(df['math score'] >= passmark).mean()

0.865

In [131]:
# Какая доля студентов, проходивших курс подготовки к экзамену, сдала экзамен по математике?
(df[df['test preparation'] == 'completed']['math score'] >= passmark).mean()

0.9217877094972067

In [132]:
# Какая доля женщин, не проходивших курс подготовки к экзамену, не сдала экзамен по математике? 
(df[ (df['gender'] == 'female') & (df['test preparation'] != 'completed') ]['math score'] < passmark).mean()

0.20958083832335328

**Задание 11. С помощью groupby выполните задания ниже. Также выведите время выполнения каждого из заданий.**
    * Для каждой этнической группы выведите средний балл за экзамен по чтению
    * Для каждого уровня образования выведите минимальный балл за экзамен по письму

In [133]:
# your code here
import datetime
import time 
start = datetime.datetime.now()
print(df.groupby('race/ethnicity')['reading score'].mean())
print(datetime.datetime.now() - start)

race/ethnicity
group A    64.674157
group B    67.352632
group C    69.103448
group D    70.030534
group E    73.028571
Name: reading score, dtype: float64
0:00:00.002629

In [134]:
start = datetime.datetime.now()
print(df.groupby('education')['writing score'].min())
print(datetime.datetime.now() - start)

education
associate's degree    35
bachelor's degree     38
high school           15
master's degree       46
some college          19
some high school      10
Name: writing score, dtype: int64
0:00:00.002683

**Задание 12. Выполните задание 11 с помощью циклов. Сравните время выполнения.**

In [135]:
# your code here
start = datetime.datetime.now()
d = dict()
for row in df.iterrows():
    race = row[1]['race/ethnicity']
    score = row[1]['reading score']
    if race not in d:
        d[race] = {'cnt': 1, 'score': score}
    else:
        d[race] = {'cnt': d[race]['cnt'] + 1, 'score': d[race]['score'] + score} 
for k in d.keys():
    print(k, end=' ')
    print(d[k]['score'] / d[k]['cnt'])
print(datetime.datetime.now() - start)

group B 67.35263157894737
group D 70.03053435114504
group C 69.10344827586206
group E 73.02857142857142
group A 64.67415730337079
0:00:00.066644

In [136]:
start = datetime.datetime.now()
d = dict()
for row in df.iterrows():
    edu = row[1]['education']
    score = row[1]['writing score']
    if edu not in d:
        d[edu] = score
    else:
        d[edu] = score if score < d[edu] else d[edu]
print(d)
print(datetime.datetime.now() - start)

{'some college': 19, "bachelor's degree": 38, "associate's degree": 35, 'high school': 15, "master's degree": 46, 'some high school': 10}
0:00:00.060264

**Задание 13. Выведите на экран средние баллы студентов по каждому предмету в зависимости от пола и уровня образования. То есть должно получиться количество групп, равных 2 * (число уровней образования), и для каждой такой группы выыведите средний балл по каждому из предметов.**

Это можно сделать с помощью сводных таблиц (pivot_table):

https://www.kaggle.com/kamilpolak/tutorial-how-to-use-pivot-table-in-pandas

In [137]:
# your code here
df.groupby(by=['gender', 'education']).mean()

                           math score  reading score  writing score
gender education
female associate's degree   65.250000      74.120690      74.000000
       bachelor's degree    68.349206      77.285714      78.380952
       high school          59.351064      68.202128      66.691489
       master's degree      66.500000      76.805556      77.638889
       some college         65.406780      73.550847      74.050847
       some high school     59.296703      69.109890      68.285714
male   associate's degree   70.764151      67.433962      65.405660
       bachelor's degree    70.581818      68.090909      67.654545
       high school          64.705882      61.480392      58.539216
       master's degree      74.826087      73.130435      72.608696
       some college         69.009259      64.990741      63.148148
       some high school     67.840909      64.693182      61.375000

#### Задание 14. Сколько студентов успешно сдали экзамен по математике?

Создайте новый столбец в таблице df под названием Math_PassStatus и запишите в него F, если студент не сдал экзамен по математике (балл за экзамен < passmark), и P иначе.

Посчитайте количество студентов, сдавших и не сдавших экзамен по математике.

Сделайте аналогичные шаги для экзаменов по чтению и письму.

In [138]:
# your code here
df['Math_PassStatus'] = df['math score'].apply(lambda x: 'F' if x < passmark else 'P')
df['Math_PassStatus'].value_counts()

P    865
F    135
Name: Math_PassStatus, dtype: int64

In [139]:
df['Reading_PassStatus'] = df['reading score'].apply(lambda x: 'F' if x < passmark else 'P')
df['Reading_PassStatus'].value_counts()

P    910
F     90
Name: Reading_PassStatus, dtype: int64

In [140]:
df['Writing_PassStatus'] = df['writing score'].apply(lambda x: 'F' if x < passmark else 'P')
df['Writing_PassStatus'].value_counts()

P    886
F    114
Name: Writing_PassStatus, dtype: int64

#### Задание 15. Сколько студентов успешно сдали все экзамены?

Создайте столбец OverAll_PassStatus и запишите в него для каждого студента 'F', если студент не сдал хотя бы один из трех экзаменов, а иначе 'P'.

Посчитайте количество студентов, которые сдали все экзамены.

In [141]:
# your code here
df['OverAll_PassStatus'] = df[['Math_PassStatus', 'Reading_PassStatus', 'Writing_PassStatus']].apply(lambda x: 'F' if 'F' in [x['Math_PassStatus'] , x['Reading_PassStatus'], x['Writing_PassStatus']] else 'P' , axis=1)
df['OverAll_PassStatus'].value_counts()

P    812
F    188
Name: OverAll_PassStatus, dtype: int64

#### Задание 16. Переведем баллы в оценки

### Система перевода баллов в оценки
####      90 и больше = A
####      80-89 = B
####      70-79 = C
####      60-69 = D
####      50-59 = E
####    меньше 50 = F (Fail)

Создайте вспомогательную функцию, которая будет по среднему баллу за три экзамена выставлять оценку студенту по данным выше критериям.

Создайте столбец Grade и запишите в него оценку каждого студента.

Выведите количество студентов, получивших каждую из оценок.

In [142]:
df.head()

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score,Math_PassStatus,Reading_PassStatus,Writing_PassStatus,OverAll_PassStatus
0,male,group B,some college,standard,none,group2,79,67,67,P,P,P,P
1,male,group D,bachelor's degree,standard,completed,group2,68,74,74,P,P,P,P
2,female,group D,associate's degree,standard,none,group2,85,91,89,P,P,P,P
3,male,group B,high school,standard,completed,group2,60,44,47,P,F,F,F
4,male,group C,some college,standard,completed,group2,98,86,90,P,P,P,P

In [144]:
def GetGrade(average_mark):
    # your code here    
    if average_mark >= 90:
        return 'A'
    elif average_mark >= 80:
        return 'B'
    elif average_mark >= 70:
        return 'C'
    elif average_mark >= 60:
        return 'D'
    elif average_mark >= 50:
        return 'E'
    else:
        return 'F'
# your code here
df['Grade'] = df.apply(lambda x: GetGrade((x['math score'] + x['reading score'] + x['writing score'])/3) , axis=1)
df['Grade'].value_counts()

C    261
D    256
E    182
B    146
F    103
A     52
Name: Grade, dtype: int64